app/Controllers/AdminController.php

    public function index()
    {
        $data['admins'] = (new AdminModel())->findAll();
---
SELECT *
FROM `admins`