app/Controllers/Auth.php

SELECT *
FROM `admins`
WHERE `username` = 'Rioandika.123'
 LIMIT 1
---
    public function loginAction()
    {
        $rules = [
            'username' => 'required',
            'password' => 'required'
        ];

        if (!$this->validate($rules)) {
            return redirect()->to('/login')->withInput()->with('errors', $this->validator->getErrors());
        }

        $adminModel = new AdminModel();
        $username  = $this->request->getPost('username');
        $password  = $this->request->getPost('password');
        $admin     = $adminModel->where('username', $username)->first();