app/Controllers/Dashboard.php

    public function index()
    {
        // 3. Buat instance dari setiap model
        $pelangganModel = new PelangganModel();
        $transaksiModel = new TransaksiModel();
        $gasModel = new GasModel();

        // 4. Siapkan sebuah array untuk menampung semua data yang akan dikirim ke view
        $data = [
            'title'                 => 'Dashboard',
            'total_pelanggan'       => $pelangganModel->countAllResults(),
            'total_gas'             => $gasModel->countAllResults(),
            'transaksi_bulan_ini'   => $transaksiModel
                                        ->where('MONTH(tanggal_transaksi)', date('m')) // Filter bulan ini
                                        ->where('YEAR(tanggal_transaksi)', date('Y'))  // Filter tahun ini
                                        ->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `pelanggan`
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE MONTH(tanggal_transaksi) = '07'
AND YEAR(tanggal_transaksi) = '2025'