app/Models/TransaksiModel.php

    public function getTransaksiWithDetails($id = null)
    {
        $builder = $this->select('transaksi.*, pelanggan.nama as nama_pelanggan')
                        ->join('pelanggan', 'pelanggan.id_pelanggan = transaksi.id_pelanggan');

        if ($id === null) {
            // Jika tidak ada ID, ambil semua data untuk halaman index
            return $builder->orderBy('transaksi.created_at', 'DESC')->findAll();
---
SELECT `transaksi`.*, `pelanggan`.`nama` as `nama_pelanggan`
FROM `transaksi`
JOIN `pelanggan` ON `pelanggan`.`id_pelanggan` = `transaksi`.`id_pelanggan`
ORDER BY `transaksi`.`created_at` DESC